---
title: StructuralSectionIWelded
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# StructuralSectionIWelded

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BottomFlangeThickness { get; set; }` | `structuralSectionIWelded.BottomFlangeThickness` | Double |
| `Double BottomFlangeWidth { get; set; }` | `structuralSectionIWelded.BottomFlangeWidth` | Double |
| `Double TopFlangeThickness { get; set; }` | `structuralSectionIWelded.TopFlangeThickness` | Double |
| `Double TopFlangeWidth { get; set; }` | `structuralSectionIWelded.TopFlangeWidth` | Double |
| `Double WebHeight { get; set; }` | `structuralSectionIWelded.WebHeight` | Double |
| `Double WebThickness { get; set; }` | `structuralSectionIWelded.WebThickness` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```